app/controllers/user_sessions_controller.rb

SELECT "users".id FROM "users" WHERE ("users"."identifier" = 'http://cid-4d5c1214ffd940f3.spaces.live.com/' AND "users".id <> 16) LIMIT 1
INSERT INTO "users" ("created_at", "updated_at", "username", "identifier", "email") VALUES('2010-07-31 08:48:02', '2010-07-31 08:48:02', 'hatem.mb', 'https://www.google.com/profiles/113899485009174885291', 'hatem.mb@gmail.com')
---
  def create
    if user_data = RPXNow.user_data(params[:token])
      user_data = {:identifier => user_data[:identifier], :username => user_data[:username], :email => user_data[:email]}
      if self.current_user = User.find_by_identifier(user_data[:identifier])
        redirect_back_or_default root_path
      else
        self.current_user = User.create!(user_data)