app/controllers/users_controller.rb

SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1
---
  def show
    @user = User.find(params[:id])

SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1
---
  def edit
    @user = User.find(params[:id])

INSERT INTO "users" ("created_at", "updated_at", "username", "identifier", "email") VALUES('2010-07-31 08:42:40', '2010-07-31 08:42:40', NULL, NULL, NULL)
---
  def create
    @user = User.new(params[:user])
    if @user.save

SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1
UPDATE "users" SET "updated_at" = '2010-08-02 06:38:23', "email" = 'aaa@aaa.cccc', "username" = 'HatemMahmoudT' WHERE "id" = 18
---
  def update
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])

SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1
DELETE FROM "users" WHERE "id" = 1
---
  def destroy
    @user = User.find(params[:id])
    @user.destroy